# # C.R.U.D
# # create
# a=[1,1.1,"a", [1], (1,2), True]
# b=list()
# # Retrive
# a[0]
# b = [1,2,3]
# b.index(3)
# print(b)
# update
# a=[1,2.3]
# # a.append(4)#добавляет значение
# # a.append(["a","b"])
# # a.insert(0,4)#амена 1 число на 4
# # a.extend([5,6,7])#добавляет данные в список
# # # delete
# # del a[0]#удоляет первое число
# # a.clear()#полностью удаляет
# # a.pop() #Удаляет элемент по индексу
# # a.remove(5) #Удоляет элемент по значения
# a=[1,2,3]
# b=[4,5,6]
# c= a+b
# a +=b #
# c=a*b
# a*=b
# print(c)
# b= [[1,2,3],[4,5,6],[7,8,9]]
# a.count(1)#показывается сколько одинаковых символов
# a.copy()
# a.reverse()#переворачивают
# a.sort()
# a.sort(reverse=True)#сортировка в порялке убывания


